import numpy as np

tip_indices = [4, 9, 14, 19, 24, ]
xhand_tip_indices = [4, 9, 14, 19, 24, 3, 7, 12, 17, 23]

tip_indices_origin = [0, 0, 6, 11, 21, 16]
tip_indices_target = [2, 3, 7, 12, 22, 17]

hand2inspire = np.array([[0, -1, 0, 0],
                         [0, 0, -1, 0],
                         [1, 0, 0, 0],
                         [0, 0, 0, 1]])

hand2xhand = np.array([[ 0.,  0.,  1.,  0.],
                     [ 0.,  1.,  0.,  0.],
                     [-1.,  0.,  0.,  0.],
                     [ 0.,  0.,  0.,  1.]])

hand2assemble = np.array([[0, -1, 0, 0],
                         [0, 0, -1, 0],
                         [1, 0, 0, 0],
                         [0, 0, 0, 1]])

grd_yup2grd_zup = np.array([[0, 0, -1, 0],
                            [-1, 0, 0, 0],
                            [0, 1, 0, 0],
                            [0, 0, 0, 1]])

vuer2linker_l_finger = np.array([[0, -1, 0, 0],
                                 [-1, 0, 0, 0],
                                 [0, 0, -1, 0],
                                 [0, 0, 0, 1]])

vuer2linker_l_arm = np.array([[0, -1, 0, 0],
                              [0, 0, 1, 0],
                              [-1, 0, 0, 0],
                              [0, 0, 0, 1]])

# 右手
vuer2linker_r_finger = np.array([[0, -1, 0, 0],
                                 [-1, 0, 0, 0],
                                 [0, 0, -1, 0],
                                 [0, 0, 0, 1]])



# 绕 x 轴旋转 +90°
vuer2linker_1 = np.array([[1, 0,  0, 0],
                                [0, 0, -1, 0],
                                [0, 1,  0, 0],
                                [0, 0,  0, 1]])

# 绕 x 轴旋转 -90°
vuer2linker_2 = np.array([[1, 0, 0,  0],
                                [0, 0, 1,  0],
                                [0, -1, 0, 0],
                                [0, 0, 0,  1]])

# 绕 y 轴旋转 +90°
vuer2linker_3 = np.array([[0, 0, 1, 0],
                                [0, 1, 0, 0],
                                [-1, 0, 0, 0],
                                [0, 0, 0, 1]])

# 绕 y 轴旋转 -90°
vuer2linker_4 = np.array([[0, 0, -1, 0],
                        [0, 1,  0, 0],
                        [1, 0,  0, 0],
                        [0, 0,  0, 1]])

# 绕 z 轴旋转 +90°
vuer2linker_5 = np.array([[0, -1, 0, 0],
                                [1,  0, 0, 0],
                                [0,  0, 1, 0],
                                [0,  0, 0, 1]])

# 绕 z 轴旋转 -90°
vuer2linker_6 = np.array([[0,  1, 0, 0],
                         [-1, 0, 0, 0],
                         [0,  0, 1, 0],
                         [0,  0, 0, 1]])

# 绕 x 轴旋转 180°
vuer2linker_7 = np.array([[1,  0,  0, 0],
                   [0, -1,  0, 0],
                   [0,  0, -1, 0],
                   [0,  0,  0, 1]])

# 绕 y 轴旋转 180°
vuer2linker_8 = np.array([[-1, 0,  0, 0],
                   [ 0, 1,  0, 0],
                   [ 0, 0, -1, 0],
                   [ 0, 0,  0, 1]])

# 绕 z 轴旋转 180°
vuer2linker_9 = np.array([[-1,  0, 0, 0],
                   [ 0, -1, 0, 0],
                   [ 0,  0, 1, 0],
                   [ 0,  0, 0, 1]])